## SQLite-tehtävät

#### Tehtävä 1. Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [14]:
# tuodaan SQLite3-kirjasto ja Pandas
import sqlite3
import pandas as pd

# tallennetaan testitietokanta muuttujaan
db_name = 'testi.db'

#### Tehtävä 2. Luo yhteys tietokantaan

In [36]:
# luodaan yhteystietokantaan ja tulostetaan konsoliin viesti
database_connection = sqlite3.connect(db_name)
c = database_connection.cursor()
print("Connected to SQLite")

Connected to SQLite

#### Tehtävä 3. Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [16]:
# luodaan taulu, jonka nimi on "henkilotaulu"
c.execute('''CREATE TABLE henkilotaulu (
    Nimi,
    Ika integer not null,
    Kengankoko integer not null,
    unique (Nimi, Ika, Kengankoko)
);''')

In [17]:
# tehdään esimerkin rivit tietokannan tauluun
data_rows = [
    ("Teppo", 88, 47),
    ("Matti", 34, 39),
    ("Ilona", 41, 36),
    ("Sonja", 32, 37)
            ]

# ajetaan rivit sisään for-loopin avulla aiemmin luotuun tauluun
for data_row in data_rows:
    c.execute('''INSERT INTO henkilotaulu VALUES {0}'''.format(data_row))
        # saadaan errori, jos yritetään työntää samoja rivejä tauluun

database_connection.commit()

#### Tehtävä 4. Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [18]:
# haetaan aiemmin luotu taulu
sql_query = '''SELECT * FROM henkilotaulu'''


# muodostetaan hausta pandasin dataframe
dataframe_from_sqlite = pd.read_sql(sql_query, database_connection)


# tehdään lista "hatunkoko" ja lisätään ne arvot dataframeen
hatunkoko = [63, 55, 55, 54]
dataframe_from_sqlite['Hatunkoko'] = hatunkoko


# tulosetaan dataframe
dataframe_from_sqlite

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47         63
1  Matti   34          39         55
2  Ilona   41          36         55
3  Sonja   32          37         54

#### Tehtävä 5. Tee taulusta kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla

In [21]:
# tehdään aiempien muutosten perusteella uusi taulu
dataframe_from_sqlite.to_sql(name="henkilotaulukopio", con=database_connection, if_exists='fail', index=False)

In [38]:
# lisätään rivi uuteen tauluun rivi
c.execute('''INSERT INTO henkilotaulukopio VALUES ('Ville', '29', '44.5', '59');''')

In [39]:
# tehdään uusi haku, haetaan kopiotaulu, joka luotiin
sql_query2 = '''SELECT * FROM henkilotaulukopio'''

In [40]:
dataframe_from_sqlite2 = pd.read_sql(sql_query2, database_connection)

# tulostetaan uusi taulukkokopio alkuperäisestä, jossa on myös hatunkoko ja uusi lisätty rivi
dataframe_from_sqlite2

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88        47.0         63
1  Matti   34        39.0         55
2  Ilona   41        36.0         55
3  Sonja   32        37.0         54
4  Ville   29        44.5         59

#### Tehtävä 6. Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [41]:
# suljetaan yhteys tietokantaan
database_connection.close()